## Analytic Functions - Filtering

Let us go through the solution for getting top 5 daily products based up on the revenue. In that process we will understand how to apply filtering on top of the derived values using analytic functions.

In [5]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [6]:
%env DATABASE_URL=postgresql://itversity_retail_user:retail_password@localhost:5432/itversity_retail_db

env: DATABASE_URL=postgresql://itversity_retail_user:retail_password@localhost:5432/itversity_retail_db

### Order of execution of SQL

Let us review the order of execution of SQL. First let us review the order of writing the query.

1. **SELECT**
2. **FROM**
3. **JOIN** or **OUTER JOIN** with **ON**
4. **WHERE**
5. **GROUP BY** and optionally **HAVING**
6. **ORDER BY**

Let us come up with a query which will compute daily revenue using COMPLETE or CLOSED orders and also sorted by order_date.

In [7]:
%%sql

SELECT o.order_date,
    round(sum(oi.order_item_subtotal)::numeric, 2) AS revenue
FROM orders o JOIN order_items oi
ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
GROUP BY o.order_date
ORDER BY o.order_date
LIMIT 10

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), Decimal('31547.23')),
 (datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23')),
 (datetime.datetime(2013, 7, 27, 0, 0), Decimal('48411.48')),
 (datetime.datetime(2013, 7, 28, 0, 0), Decimal('35672.03')),
 (datetime.datetime(2013, 7, 29, 0, 0), Decimal('54579.70')),
 (datetime.datetime(2013, 7, 30, 0, 0), Decimal('49329.29')),
 (datetime.datetime(2013, 7, 31, 0, 0), Decimal('59212.49')),
 (datetime.datetime(2013, 8, 1, 0, 0), Decimal('49160.08')),
 (datetime.datetime(2013, 8, 2, 0, 0), Decimal('50688.58')),
 (datetime.datetime(2013, 8, 3, 0, 0), Decimal('43416.74'))]

In [8]:
%%sql

SELECT o.order_date,
    round(sum(oi.order_item_subtotal)::numeric, 2) AS revenue
FROM orders o JOIN order_items oi
ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
GROUP BY o.order_date
    HAVING round(sum(oi.order_item_subtotal)::numeric, 2) >= 50000
ORDER BY order_date
LIMIT 10

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
10 rows affected.

[(datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23')),
 (datetime.datetime(2013, 7, 29, 0, 0), Decimal('54579.70')),
 (datetime.datetime(2013, 7, 31, 0, 0), Decimal('59212.49')),
 (datetime.datetime(2013, 8, 2, 0, 0), Decimal('50688.58')),
 (datetime.datetime(2013, 8, 6, 0, 0), Decimal('57843.89')),
 (datetime.datetime(2013, 8, 12, 0, 0), Decimal('59014.74')),
 (datetime.datetime(2013, 8, 17, 0, 0), Decimal('63226.83')),
 (datetime.datetime(2013, 8, 24, 0, 0), Decimal('52650.15')),
 (datetime.datetime(2013, 9, 5, 0, 0), Decimal('59942.43')),
 (datetime.datetime(2013, 9, 6, 0, 0), Decimal('61976.10'))]

However order of execution is typically as follows.

1. **FROM**
2. **JOIN** or **OUTER JOIN** with **ON**
3. **WHERE**
4. **GROUP BY** and optionally **HAVING**
5. **SELECT**
6. **ORDER BY**

As **SELECT** is executed before **ORDER BY** clause, we will not be able to refer the aliases defined in **SELECT** caluse in other clauses except for **ORDER BY** in most of the traditional databases including Postgresql.

```{error}
This will fail as revenue which is an alias defined in **SELECT** cannot be used in **WHERE**.
```

In [9]:
%%sql

SELECT o.order_date,
    round(sum(oi.order_item_subtotal)::numeric, 2) AS revenue
FROM orders o JOIN order_items oi
ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
    AND revenue >= 50000
GROUP BY o.order_date
ORDER BY order_date
LIMIT 10

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
(psycopg2.errors.UndefinedColumn) column "revenue" does not exist
LINE 5:     AND revenue >= 50000
                ^

[SQL: SELECT o.order_date, round(sum(oi.order_item_subtotal)::numeric, 2) AS revenue
FROM orders o JOIN order_items oi
ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
    AND revenue >= 50000
GROUP BY o.order_date
ORDER BY order_date
LIMIT 10]
(Background on this error at: http://sqlalche.me/e/13/f405)

```{note}
This will also fail as we cannot use aggregate functions in `WHERE` clause.
```

In [10]:
%%sql

SELECT o.order_date,
    round(sum(oi.order_item_subtotal)::numeric, 2) AS revenue
FROM orders o JOIN order_items oi
ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
    AND round(sum(oi.order_item_subtotal)::numeric, 2) >= 50000
GROUP BY o.order_date
ORDER BY order_date
LIMIT 10

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
(psycopg2.errors.GroupingError) aggregate functions are not allowed in WHERE
LINE 5:     AND round(sum(oi.order_item_subtotal)::numeric, 2) >= 50...
                      ^

[SQL: SELECT o.order_date, round(sum(oi.order_item_subtotal)::numeric, 2) AS revenue
FROM orders o JOIN order_items oi
ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
    AND round(sum(oi.order_item_subtotal)::numeric, 2) >= 50000
GROUP BY o.order_date
ORDER BY order_date
LIMIT 10]
(Background on this error at: http://sqlalche.me/e/13/f405)

In [11]:
%%sql

SELECT o.order_date,
    round(sum(oi.order_item_subtotal)::numeric, 2) AS revenue
FROM orders o JOIN order_items oi
ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
GROUP BY o.order_date
ORDER BY order_date,
    revenue DESC
LIMIT 10

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), Decimal('31547.23')),
 (datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23')),
 (datetime.datetime(2013, 7, 27, 0, 0), Decimal('48411.48')),
 (datetime.datetime(2013, 7, 28, 0, 0), Decimal('35672.03')),
 (datetime.datetime(2013, 7, 29, 0, 0), Decimal('54579.70')),
 (datetime.datetime(2013, 7, 30, 0, 0), Decimal('49329.29')),
 (datetime.datetime(2013, 7, 31, 0, 0), Decimal('59212.49')),
 (datetime.datetime(2013, 8, 1, 0, 0), Decimal('49160.08')),
 (datetime.datetime(2013, 8, 2, 0, 0), Decimal('50688.58')),
 (datetime.datetime(2013, 8, 3, 0, 0), Decimal('43416.74'))]

In [12]:
%%sql

SELECT o.order_date,
    round(sum(oi.order_item_subtotal)::numeric, 2) AS revenue
FROM orders o JOIN order_items oi
ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
GROUP BY o.order_date
    HAVING round(sum(oi.order_item_subtotal)::numeric, 2) >= 50000
ORDER BY order_date
LIMIT 10

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
10 rows affected.

[(datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23')),
 (datetime.datetime(2013, 7, 29, 0, 0), Decimal('54579.70')),
 (datetime.datetime(2013, 7, 31, 0, 0), Decimal('59212.49')),
 (datetime.datetime(2013, 8, 2, 0, 0), Decimal('50688.58')),
 (datetime.datetime(2013, 8, 6, 0, 0), Decimal('57843.89')),
 (datetime.datetime(2013, 8, 12, 0, 0), Decimal('59014.74')),
 (datetime.datetime(2013, 8, 17, 0, 0), Decimal('63226.83')),
 (datetime.datetime(2013, 8, 24, 0, 0), Decimal('52650.15')),
 (datetime.datetime(2013, 9, 5, 0, 0), Decimal('59942.43')),
 (datetime.datetime(2013, 9, 6, 0, 0), Decimal('61976.10'))]

```{error}
This one will also fail as we are trying to use alias `drnk` from `SELECT` clause in `WHERE` clause.
```

In [13]:
%%sql


SELECT t.*,
dense_rank() OVER (
  PARTITION BY order_date
  ORDER BY revenue DESC
) AS drnk
FROM daily_product_revenue t
WHERE drnk <= 5

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
(psycopg2.errors.UndefinedColumn) column "drnk" does not exist
LINE 6: WHERE drnk <= 5
              ^

[SQL: SELECT t.*, dense_rank() OVER (
  PARTITION BY order_date
  ORDER BY revenue DESC
) AS drnk
FROM daily_product_revenue t
WHERE drnk <= 5]
(Background on this error at: http://sqlalche.me/e/13/f405)

### Overview of Sub Queries

Let us recap about Sub Queries.

* We typically have Sub Queries in **FROM** Clause.
* We need to provide alias to the Sub Queries in **FROM** Clause in Postgresql.
* We use sub queries quite often over queries using Analytics/Windowing Functions

In [14]:
%%sql

SELECT * FROM (SELECT current_date) AS q

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(datetime.date(2020, 12, 1),)]

Let us see few more examples with respect to Sub Queries.

In [15]:
%%sql

SELECT * FROM (
  SELECT order_date, count(1) AS order_count
  FROM orders
  GROUP BY order_date
) AS q
ORDER BY order_date
LIMIT 10

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 143),
 (datetime.datetime(2013, 7, 26, 0, 0), 269),
 (datetime.datetime(2013, 7, 27, 0, 0), 202),
 (datetime.datetime(2013, 7, 28, 0, 0), 187),
 (datetime.datetime(2013, 7, 29, 0, 0), 253),
 (datetime.datetime(2013, 7, 30, 0, 0), 227),
 (datetime.datetime(2013, 7, 31, 0, 0), 252),
 (datetime.datetime(2013, 8, 1, 0, 0), 246),
 (datetime.datetime(2013, 8, 2, 0, 0), 224),
 (datetime.datetime(2013, 8, 3, 0, 0), 183)]

In [16]:
%%sql

SELECT * FROM (
  SELECT order_date, count(1) AS order_count
  FROM orders
  GROUP BY order_date
) q
WHERE q.order_count > 150
ORDER BY order_date
LIMIT 10

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
10 rows affected.

[(datetime.datetime(2013, 7, 26, 0, 0), 269),
 (datetime.datetime(2013, 7, 27, 0, 0), 202),
 (datetime.datetime(2013, 7, 28, 0, 0), 187),
 (datetime.datetime(2013, 7, 29, 0, 0), 253),
 (datetime.datetime(2013, 7, 30, 0, 0), 227),
 (datetime.datetime(2013, 7, 31, 0, 0), 252),
 (datetime.datetime(2013, 8, 1, 0, 0), 246),
 (datetime.datetime(2013, 8, 2, 0, 0), 224),
 (datetime.datetime(2013, 8, 3, 0, 0), 183),
 (datetime.datetime(2013, 8, 4, 0, 0), 187)]

```{note}
Above query is an example for sub queries. We can achieve using HAVING clause (no need to have sub query to filter)
```

### Filtering - Analytic Function Results

Let us understand how to filter on top of results of Analytic Functions.

* We can use Analytic Functions only in **SELECT** Clause.
* If we have to filter based on Analytic Function results, then we need to use Sub Queries.
* Once the query is added as subquery, we can apply filter using aliases of the Analytic Functions.

Here is the example where we can filter data based on Analytic Functions.

In [17]:
%%sql

SELECT t.*,
dense_rank() OVER (
  PARTITION BY order_date
  ORDER BY revenue DESC
) AS drnk
FROM daily_product_revenue t
WHERE drnk <= 5

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
(psycopg2.errors.UndefinedColumn) column "drnk" does not exist
LINE 6: WHERE drnk <= 5
              ^

[SQL: SELECT t.*, dense_rank() OVER (
  PARTITION BY order_date
  ORDER BY revenue DESC
) AS drnk
FROM daily_product_revenue t
WHERE drnk <= 5]
(Background on this error at: http://sqlalche.me/e/13/f405)

In [18]:
%%sql

SELECT * FROM (
  SELECT t.*,
    dense_rank() OVER (
      PARTITION BY order_date
      ORDER BY revenue DESC
    ) AS drnk
  FROM daily_product_revenue t
) q
WHERE q.drnk <= 5
ORDER BY q.order_date, q.revenue DESC
LIMIT 10

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 1004, Decimal('5599.72'), 1),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('5099.49'), 2),
 (datetime.datetime(2013, 7, 25, 0, 0), 957, Decimal('4499.70'), 3),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('3359.44'), 4),
 (datetime.datetime(2013, 7, 25, 0, 0), 1073, Decimal('2999.85'), 5),
 (datetime.datetime(2013, 7, 26, 0, 0), 1004, Decimal('10799.46'), 1),
 (datetime.datetime(2013, 7, 26, 0, 0), 365, Decimal('7978.67'), 2),
 (datetime.datetime(2013, 7, 26, 0, 0), 957, Decimal('6899.54'), 3),
 (datetime.datetime(2013, 7, 26, 0, 0), 191, Decimal('6799.32'), 4),
 (datetime.datetime(2013, 7, 26, 0, 0), 1014, Decimal('4798.08'), 5)]